<?php

namespace Database\Seeders;

use App\Models\FeedbackQuestion;
use Illuminate\Database\Seeder;

class FeedbackQuestionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $questions = [
            "لەدەستپێکی خوێندنی بابەتەکەدا، مامۆستا کۆرسبوکی بابەتەکەی پێتاندا و پلانی خوێندنی بابەتەکەی لە هەفتەکانی سالی خوێندندا ڕوونکردەوە؟",
            "لەهەفتەکانی خوێندنی بابەتەکەدا، مامۆستا پابەندبوو بەو سلیبەسەی کە لە کۆرسبووکی بابەتەکەیدا هەبوو؟",
            "مامۆستا هەوڵی دا ئامانج و گرنگی و هەبوونی بابەتەکەی لەناو پڕۆگرامی خوێندندا ڕوون بکاتەوە ؟",
            "لەکاتی وانە وتنەوەدا مامۆستا هەولی دا بنەما و ناوەڕۆک و خاڵە گرنگەکانی بابەتەکە بە ڕوونی و بە سادەیی شیبکاتەوە؟",
            "شێوازی هەلسەنگاندن و پرسیارەکانی تاقیکردنەوەی لەبار و گونجاو بوون؟",
            "شێوازی هەلسەنگاندن و پرسیارەکانی تاقیکردنەوەی لەبار و گونجاو بوون؟",
            "لەکاتی وانە وتنەوەدا مامۆستا بە نەرمی و بەهێمنی و بە ڕێزلێنانەوە هەڵسوکەوتی دەکرد؟",
            "سلایدەکانی بەکارهێنران ، ڕوون و ئاشکرا و سەرنجڕاکێش بوون؟",
            "لەکاتی وانە وتنەوەدا مامۆستا کاتی پرسیارکردنی هێشتەوە و هەوڵی دا پرسیارەکان بە تێر و تەسەلی وەڵام بداتەوە؟",
            "لەکاتی وانە وتنەوەدا مامۆستا ئاماژەی بە سەرچاوەی نوێ دەکرد؟",
        ];

        foreach ($questions as $question) {
            FeedbackQuestion::create(['question' => $question]);
        }
    }
}
